results/1/server1/apiary-1.1.0/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.33ms   51.29ms   1.66s    99.86%
    Req/Sec    14.44k     2.97k   31.68k    67.03%
  840892 requests in 30.00s, 163.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 213
Requests/sec:  28029.83
Transfer/sec:      5.45MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.31ms   18.88ms   1.62s    99.62%
    Req/Sec    14.26k     2.28k   25.48k    71.27%
  835578 requests in 30.00s, 162.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 165
Requests/sec:  27852.42
Transfer/sec:      5.42MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.27ms  195.84ms   2.15s    99.01%
    Req/Sec    14.50k     2.89k   41.89k    76.04%
  821113 requests in 30.00s, 159.75MB read
  Socket errors: connect 0, read 0, write 0, timeout 198
Requests/sec:  27366.04
Transfer/sec:      5.32MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.19ms   19.88ms   1.66s    99.65%
    Req/Sec    14.29k     2.11k   24.65k    68.52%
  838377 requests in 30.00s, 163.11MB read
  Socket errors: connect 0, read 0, write 0, timeout 139
Requests/sec:  27945.87
Transfer/sec:      5.44MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.30ms  175.92ms   1.83s    98.89%
    Req/Sec    14.88k     3.97k   36.45k    74.21%
  848874 requests in 30.00s, 165.15MB read
  Socket errors: connect 0, read 0, write 0, timeout 267
Requests/sec:  28295.78
Transfer/sec:      5.50MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.63ms   15.02ms   1.24s    97.79%
    Req/Sec    13.79k     2.15k   27.50k    64.94%
  808487 requests in 30.00s, 157.29MB read
  Socket errors: connect 0, read 0, write 0, timeout 377
Requests/sec:  26949.45
Transfer/sec:      5.24MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.58ms   58.88ms   1.67s    99.78%
    Req/Sec    14.36k     3.71k   33.24k    67.36%
  833031 requests in 30.00s, 162.07MB read
  Socket errors: connect 0, read 0, write 0, timeout 479
Requests/sec:  27767.55
Transfer/sec:      5.40MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.59ms   24.04ms   1.49s    99.73%
    Req/Sec    14.09k     2.41k   25.71k    67.21%
  821343 requests in 30.00s, 159.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 257
Requests/sec:  27378.11
Transfer/sec:      5.33MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.61ms  117.71ms   2.01s    99.43%
    Req/Sec    14.36k     3.54k   35.83k    71.01%
  824023 requests in 30.00s, 160.31MB read
  Socket errors: connect 0, read 0, write 0, timeout 478
Requests/sec:  27466.64
Transfer/sec:      5.34MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.70ms   21.57ms   1.36s    99.66%
    Req/Sec    14.12k     2.27k   26.70k    72.24%
  829175 requests in 30.00s, 161.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 176
Requests/sec:  27639.28
Transfer/sec:      5.38MB
=================== summary ===================
machine:      server1
ghc version:  7.8.3
bench target: apiary-1.1.0
bench:        PARAM
bench mode:   30s * 10
average:      27669.10
stdev:        391.44
=================== oneline ===================
server1,7.8.3,apiary-1.1.0,PARAM,30s,10,27669.10,391.44